app/Controllers/Admin.php

SELECT SUM(`hits`) AS `hits`
FROM `berita`
WHERE `jenis_berita` = 'Berita'
 LIMIT 1
SELECT COUNT(`berita`.`berita_id`) AS `berita_id`
FROM `berita`
JOIN `berita_komen` ON `berita_komen`.`berita_id` = `berita`.`berita_id`
WHERE `jenis_berita` = 'Berita'
 LIMIT 1
SELECT COUNT(`berita_id`) AS `berita_id`
FROM `berita`
WHERE `jenis_berita` = 'Berita'
 LIMIT 1
SELECT *
FROM `berita`
JOIN `users` ON `users`.`id` = `berita`.`id`
JOIN `kategori` ON `kategori`.`kategori_id` = `berita`.`kategori_id`
WHERE `status` = '1'
AND `jenis_berita` = 'Berita'
ORDER BY `hits` DESC
 LIMIT 8
SELECT COUNT(`berita_id`) AS `berita_id`
FROM `berita`
WHERE `jenis_berita` = 'Berita'
AND `status` = 1
 LIMIT 1
SELECT COUNT(`berita_id`) AS `berita_id`
FROM `berita`
WHERE `jenis_berita` = 'Berita'
AND `status` = 0
 LIMIT 1
---
	public function index()
	{
		if (session()->get('id') == '') {
			return redirect()->to('');
		}
		$id_grup 	 = session()->get('id_grup');
		$id 		 = session()->get('id');
		// berita
		$urlgetberita = 'berita/all';
		$listgrupfberita  =  $this->grupakses->listgrupakses($id_grup, $urlgetberita);

		foreach ($listgrupfberita as $data) :
			$aksesberita = $data['akses'];
		endforeach;

		if ($aksesberita == '1') {
			$berita 				= $this->berita->totberita();
			$populer 				= $this->berita->populer()->paginate(8);
			$hitsberita 			= $this->berita->selectSum('hits')->where('jenis_berita', 'Berita')->first();
			$komentarberita 		= $this->berita->selectCount('berita.berita_id')->join('berita_komen', 'berita_komen.berita_id = berita.berita_id')->where('jenis_berita', 'Berita')->first();
			$beritaall 				= $this->berita->selectCount('berita_id')->where('jenis_berita', 'Berita')->first();
			$beritapublish 			= $this->berita->selectCount('berita_id')->where('jenis_berita', 'Berita')->where('status', 1)->first();
			$beritaunpublish 		= $this->berita->selectCount('berita_id')->where('jenis_berita', 'Berita')->where('status', 0)->first();

SELECT COUNT(`bankdata_id`) AS `bankdata_id`
FROM `bankdata`
 LIMIT 1
---
			endforeach;

			if ($aksesbank == '1') {
				$bank = $this->bankdata->selectCount('bankdata_id')->first();

SELECT COUNT(`kritiksaran_id`) AS `kritiksaran_id`
FROM `kritiksaran`
WHERE `status` = 0
 LIMIT 1
SELECT COUNT(`kritiksaran_id`) AS `kritiksaran_id`
FROM `kritiksaran`
WHERE `status` = 2
 LIMIT 1
SELECT COUNT(`kritiksaran_id`) AS `kritiksaran_id`
FROM `kritiksaran`
WHERE `status` = 1
 LIMIT 1
SELECT COUNT(`kritiksaran_id`) AS `kritiksaran_id`
FROM `kritiksaran`
 LIMIT 1
---
		$konfigurasi 				= $this->konfigurasi->vkonfig();
		$grupakses   				= $this->grupakses->grupaksessubmenu($id_grup, $gm);
		$tadmin 					= $this->template->tempadminaktif();
		$kritiknew 					= $this->kritiksaran->selectCount('kritiksaran_id')->where('status', 0)->first();
		$kritikpublish				= $this->kritiksaran->selectCount('kritiksaran_id')->where('status', 2)->first();
		$kritikunpublish			= $this->kritiksaran->selectCount('kritiksaran_id')->where('status', 1)->first();
		$kritikall					= $this->kritiksaran->selectCount('kritiksaran_id')->first();

SELECT COUNT(`tag_id`) AS `tag_id`
FROM `tag`
 LIMIT 1
---
			'subtitle'				=> $konfigurasi->nama,
			'beritapopuler' 		=> $populer,
			'berita'				=> $berita,
			'tagar' 				=> $this->tag->selectCount('tag_id')->first(),

SELECT *
FROM `agenda`
JOIN `users` ON `users`.`id` = `agenda`.`id`
ORDER BY `agenda_id` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `agenda`
JOIN `users` ON `users`.`id` = `agenda`.`id`
---
			'totlayanan' 			=> $layanan,
			'totpengumuman' 		=> $pengumuman,
			'bankdata' 				=> $bank,
			'agenda'      			=> $this->agenda->listagendapage()->paginate(1),

SELECT *
FROM `agenda`
JOIN `users` ON `users`.`id` = `agenda`.`id`
ORDER BY `agenda_id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `agenda`
JOIN `users` ON `users`.`id` = `agenda`.`id`
SELECT *
FROM `kritiksaran`
ORDER BY `kritiksaran_id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `kritiksaran`
---
			'warna_topbar'          => $tadmin['warna_topbar'],
			'sidebar_mode'          => $tadmin['sidebar_mode'],
			# new tema
			'agenda5'      			=> $this->agenda->listagendapage()->paginate(5),
			'suaraanda'     		=> $this->kritiksaran->listsuaraandaall()->paginate(6),

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
	public function getonline()
	{
		$id = session()->get('id');
		$konfigurasi         = $this->konfigurasi->vkonfig();
		if ($this->request->isAJAX()) {
			$tadmin = $this->template->tempadminaktif();
			$cari =  $this->user->find($id);