app/Controllers/Home.php

SELECT *
FROM `pegawai`
ORDER BY `pegawai_id` ASC
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `pegawai`
---
			'faq'			    => $faq,
			'ebook2'          	=> $this->ebook->listebookpage()->paginate(2),
			'ebook'          	=> $this->ebook->listebookpage()->paginate(4),
			'pegawai'          	=> $pegawai->paginate(4, 'hal'),

SELECT *
FROM `agenda`
JOIN `users` ON `users`.`id` = `agenda`.`id`
ORDER BY `agenda_id` DESC
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `agenda`
JOIN `users` ON `users`.`id` = `agenda`.`id`
SELECT *
FROM `agenda`
JOIN `users` ON `users`.`id` = `agenda`.`id`
ORDER BY `agenda_id` DESC
 LIMIT 5
SELECT *
FROM `agenda`
JOIN `users` ON `users`.`id` = `agenda`.`id`
ORDER BY `agenda_id` DESC
 LIMIT 2
SELECT *
FROM `foto`
JOIN `users` ON `users`.`id` = `foto`.`id`
JOIN `kategori_foto` ON `kategori_foto`.`kategorifoto_id` = `foto`.`kategorifoto_id`
ORDER BY `foto_id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `foto`
JOIN `users` ON `users`.`id` = `foto`.`id`
JOIN `kategori_foto` ON `kategori_foto`.`kategorifoto_id` = `foto`.`kategorifoto_id`
SELECT *
FROM `foto`
JOIN `users` ON `users`.`id` = `foto`.`id`
JOIN `kategori_foto` ON `kategori_foto`.`kategorifoto_id` = `foto`.`kategorifoto_id`
ORDER BY `foto_id` DESC
 LIMIT 8
SELECT *
FROM `bankdata`
JOIN `users` ON `users`.`id` = `bankdata`.`id`
ORDER BY `bankdata`.`bankdata_id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `bankdata`
JOIN `users` ON `users`.`id` = `bankdata`.`id`
---
			'mainmenu' 			=> $this->menu->mainmenu(),
			'footer' 			=> $this->menu->footermenu(),
			'topmenu' 			=> $this->menu->topmenu(),
			'agenda'       		=> $this->agenda->listagendapage()->paginate(4),
			'agenda5'       	=> $this->agenda->listagendapage()->paginate(5),
			'agenda2'       	=> $this->agenda->listagendapage()->paginate(2),
			'layanan'       	=> $this->layanan->listlayananpage()->paginate(6),
			'foto'      		=> $this->foto->listfotopage()->paginate(6),
			'foto8'      		=> $this->foto->listfotopage()->paginate(8),
			'pengumuman'       	=> $this->pengumuman->listpengumumanpage()->paginate(6),
			'bankdata' 			=>  $this->bankdata->listbankdatapage()->paginate(6),