app/Models/ModelBanner.php

    public function list()
    {
        return $this->table('tbl_banner')
            ->orderBy('id_banner', 'DESC')
            ->where('type', '0')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_banner`
WHERE `type` = '0'
ORDER BY `id_banner` DESC

    public function listgrafis()
    {
        return $this->table('tbl_banner')
            ->orderBy('id_banner', 'DESC')
            ->where('type', '1')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_banner`
WHERE `type` = '1'
ORDER BY `id_banner` DESC

    public function listiklantengah()
    {
        return $this->table('tbl_banner')
            ->orderBy('id_banner', 'DESC')
            ->where('type', '2')
            ->where('posisi', '1')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_banner`
WHERE `type` = '2'
AND `posisi` = '1'
ORDER BY `id_banner` DESC

    public function listiklankiri1()
    {
        return $this->table('tbl_banner')
            ->orderBy('id_banner', 'ASC')
            ->where('type', '2')
            ->where('posisi', '2')
            ->orderBy('id_banner', 'RANDOM')
            ->get(1, 0)->getResultArray();
---
SELECT *
FROM `tbl_banner`
WHERE `type` = '2'
AND `posisi` = '2'
ORDER BY `id_banner` ASC, RAND()
 LIMIT 1

    public function listinfo()
    {
        return $this->table('tbl_banner')
            ->orderBy('id_banner', 'DESC')
            ->where('type', '1')
            ->get(2, 0)->getResultArray();
---
SELECT *
FROM `tbl_banner`
WHERE `type` = '1'
ORDER BY `id_banner` DESC
 LIMIT 2

    public function listinfo3()
    {
        return $this->table('tbl_banner')
            ->orderBy('id_banner', 'DESC')
            ->where('type', '1')
            ->get(3, 0)->getResultArray();
---
SELECT *
FROM `tbl_banner`
WHERE `type` = '1'
ORDER BY `id_banner` DESC
 LIMIT 3

    public function listinfo1()
    {
        return $this->table('tbl_banner')
            ->orderBy('id_banner', 'DESC')
            ->where('type', '1')
            ->get(1, 2)->getResultArray();
---
SELECT *
FROM `tbl_banner`
WHERE `type` = '1'
ORDER BY `id_banner` DESC
 LIMIT 2, 1

    public function totinfografis()
    {
        return $this->table('tbl_banner')
            ->where('type', '1')
            ->get()->getNumRows();
---
SELECT *
FROM `tbl_banner`
WHERE `type` = '1'
ORDER BY RAND()
 LIMIT 1