app/Models/ModelInformasi.php

SELECT *
FROM `informasi`
WHERE `type` = '0'
---
    public function totlayanan()
    {
        return $this->table('informasi')
            ->where(array('type'    => '0'))
            ->get()->getNumRows();

SELECT *
FROM `informasi`
WHERE `type` = '1'
---
    public function totpengumuman()
    {
        return $this->table('informasi')
            ->where(array(
                'type'    => '1'
            ))
            ->get()->getNumRows();