app/Models/ModelKritikSaran.php

    public function listkritiknew()
    {
        return $this->table('kritiksaran')
            ->where('status', '0')
            ->orderBy('kritiksaran_id', 'DESC')
            ->get(6, 0)->getResultArray();
---
SELECT *
FROM `kritiksaran`
WHERE `status` = '0'
ORDER BY `kritiksaran_id` DESC
 LIMIT 6

    public function totkritik()
    {
        return $this->table('kritiksaran')
            ->where(array('status'    => '0'))
            ->get()->getNumRows();
---
SELECT *
FROM `kritiksaran`
WHERE `status` = '0'