app/Views/backend/morvin/pengaturan/user/vonline.php

    $id_grup        = session()->get('id_grup');
    $userid         = session()->get('id');

    $list           = $db->table('users')->where('id', $userid)->get()->getRowArray();
    $listgrupno     = $db->table('cms__usergrup')->where('id_grup', $id_grup)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '1'
SELECT *
FROM `cms__usergrup`
WHERE `id_grup` = '1'

                                <?php if ($user) {
                                    foreach ($user as $data) :
                                        $id_grupr = $data['id_grup'];
                                        $listgrup = $db->table('cms__usergrup')->where('id_grup', $id_grupr)->get()->getRowArray();
---
SELECT *
FROM `cms__usergrup`
WHERE `id_grup` = '1'