app/Views/backend/morvin/template-backend.php

$userid  = session()->get('id');
$id_grup = session()->get('id_grup');

$list = $db->table('users')->where('id', $userid)->get()->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '1'