app/Views/backend/morvin/v_dashboard.php

SELECT *
FROM `users`
WHERE `id` = '1'
---
<?= $this->extend('backend/' . $folder . '/' . 'script');
$db = \Config\Database::connect();
$userid = session()->get('id');
$list = $db->table('users')->where('id', $userid)->get()->getRowArray();